app/views/pages/home.html.erb

    <p class='home'> Hosted Projects </p>
      <% @projects = Project.limit(5).order("RANDOM()") %>
---
SELECT  "projects".* FROM "projects" ORDER BY RANDOM() LIMIT ?  [["LIMIT", 5]]