app/views/projects/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "promises".* FROM "promises" WHERE "promises"."project_id" = ? LIMIT ?  [["project_id", 9], ["LIMIT", 1]]
---
<p id="notice"><%= notice %></p>
<% @user ||= User.find_by(id: @project.user_id) %>
<% @promises ||= Promise.find_by(project_id: @project.id) %>