app/controllers/funds_controller.rb

  def new
  	@project=Project.find(params[:id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]

  def create
  	@fund = Fund.new(fund_params)
  	@project= Project.find(params[:id])
    @project.funders += 1
    @project.save
    respond_to do |format|
      if @fund.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
UPDATE "projects" SET "funders" = ? WHERE "projects"."id" = ?  [["funders", 1], ["id", 4]]
INSERT INTO "funds" ("created_at", "updated_at", "amount", "user_id", "project_id") VALUES (?, ?, ?, ?, ?)  [["created_at", "2018-06-13 01:04:50.503715"], ["updated_at", "2018-06-13 01:04:50.503715"], ["amount", 1], ["user_id", 2], ["project_id", 4]]