app/controllers/projects_controller.rb

  def favorite
    @project = Project.find(params[:favorite_project])
    @user= User.find(params[:favorite_user])
    @favorite = Favorite.new(project: @project, user: @user)
    if @favorite.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "favorites" ("created_at", "updated_at", "user_id", "project_id") VALUES (?, ?, ?, ?)  [["created_at", "2018-06-13 01:01:51.127647"], ["updated_at", "2018-06-13 01:01:51.127647"], ["user_id", 2], ["project_id", 1]]

  def index
    @projects = Project.search(params[:search])
---
SELECT "projects".* FROM "projects" WHERE (name LIKE '%Phyyrnx%')

  def show
    @project = Project.find(params[:id])
    @user ||= User.find_by(id: @project.user_id)
    @promises = Promise.where(project_id: @project.id)
    @category = Category.find_by(id: @project.category_id)
    @funders = Fund.where(project_id: @project.id).count
    @amount = Fund.where(project_id: @project.id).sum(:amount)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT  "promises".* FROM "promises" WHERE "promises"."project_id" = ? LIMIT ?  [["project_id", 9], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT COUNT(*) FROM "funds" WHERE "funds"."project_id" = ?  [["project_id", 3]]
SELECT SUM("funds"."amount") FROM "funds" WHERE "funds"."project_id" = ?  [["project_id", 3]]

  def new
    @project = Project.new
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def edit
    @categories = Category.all
---
SELECT "categories".* FROM "categories"

  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "user_id", "description", "goal", "actual", "date_limit", "funders", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "category_id" = ? WHERE "projects"."id" = ?  [["category_id", 1], ["id", 4]]

  def new_fund
    @project = Project.find(params[:id])
    @user ||= User.find_by(id: @project.user_id)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]