app/controllers/promises_controller.rb

  def new
    @project ||= Project.find_by(id: params[:project_id])
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @promise = Promise.new(promise_params)

    respond_to do |format|
      if @promise.save
---
INSERT INTO "promises" ("project_id", "description", "min", "delivery_date", "buyers", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def destroy
    @promise.destroy
---
DELETE FROM "promises" WHERE "promises"."id" = ?  [["id", 4]]

    def set_promise
      @promise = Promise.find(params[:id])
---
SELECT  "promises".* FROM "promises" WHERE "promises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]